In [1]:
import pandas as pd

In [2]:
# Task 1

data = {
    'Product': ['Laptop', 'Smartphone', 'Tablet'],
    'Price': [1200, 800, 400],
    'Stock': [50, 150, 200]
}
df = pd.DataFrame(data)

new_row = {'Product': 'USB Hub', 'Price': 40, 'Stock': 150, 'Warranty': '2 years'}

df = pd.concat([df, pd.DataFrame([new_row])], ignore_index=True)

df

      Product  Price  Stock Warranty
0      Laptop   1200     50      NaN
1  Smartphone    800    150      NaN
2      Tablet    400    200      NaN
3     USB Hub     40    150  2 years

In [5]:
# Task 2


data = {
    'Product': ['Laptop', 'Smartphone', 'Tablet'],
    'Price': [1200, 800, 400],
    'Stock': [50, 150, 200]
}
df = pd.DataFrame(data)

new_row = {'Product': 'USB Hub', 'Price': 'Forty', 'Stock': 150}

df = pd.concat([df, pd.DataFrame([new_row])], ignore_index=True)

print(df.dtypes)
df

# Price column is not integer already. Pandas allows add different data types because it does not have some validation schemas etc

Product    object
Price      object
Stock       int64
dtype: object

      Product  Price  Stock
0      Laptop   1200     50
1  Smartphone    800    150
2      Tablet    400    200
3     USB Hub  Forty    150

In [7]:
# Task 3

df = pd.read_csv("customer_feedback.csv")

grouped = df.groupby(["Region", "Month"])['Rating'].mean()

wide_table = grouped.unstack(level='Month')

wide_table = wide_table.fillna(df['Rating'].mean())

wide_table

Month    April  August  February  January    July    June   March     May
Region
East    4.2125  4.2125    4.2125   4.2125  4.6000  4.2125  4.5500  4.2125
North   4.2125  4.2125    4.2125   4.2500  4.2125  4.2125  4.2125  3.9500
South   4.2125  4.2125    3.8500   4.2125  4.2125  4.5000  4.2125  4.2125
West    3.9500  4.0500    4.2125   4.2125  4.2125  4.2125  4.2125  4.2125